# Dotfiles Dependencies
# Install with: brew bundle install

# Taps
tap "FelixKratz/formulae"          # SketchyBar
tap "nikitabobko/tap"              # AeroSpace

# ── Core System ─────────────────────────────────────────────
cask "aerospace"                    # Tiling window manager
cask "ghostty"                      # Terminal emulator
cask "hammerspoon"                  # macOS automation (audio switching)
cask "karabiner-elements"           # Keyboard remapping
brew "sketchybar"                   # Custom status bar

# ── Terminal Tools ──────────────────────────────────────────
brew "tmux"                         # Terminal multiplexer
brew "yazi"                         # TUI file manager
brew "neovim"                       # Editor
brew "stow"                         # Symlink manager (dotfiles)

# ── Shell Enhancements ─────────────────────────────────────
brew "starship"                     # Prompt
brew "zoxide"                       # Smart cd
brew "fzf"                          # Fuzzy finder
brew "zsh-autosuggestions"          # Fish-like suggestions
brew "zsh-syntax-highlighting"      # Syntax highlighting

# ── Better CLI Defaults ─────────────────────────────────────
brew "eza"                          # Modern ls
brew "bat"                          # Modern cat
brew "fd"                           # Modern find
brew "ripgrep"                      # Modern grep
brew "git-delta"                    # Better git diffs
brew "jq"                           # JSON processor

# ── Dev Essentials ──────────────────────────────────────────
brew "git"                          # Version control
brew "gh"                           # GitHub CLI
brew "node"                         # Node.js (nvim LSP plugins)
brew "lazygit"                      # Git TUI

# ── Fonts ───────────────────────────────────────────────────
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sketchybar-app-font"
